Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Comment>Категория клиента для видимости опт-каталога на сайте (Всем/Постоянный/VIP2/VIP1). Считается регламентным заданием по головному контрагенту, если не установлена вручную.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньДоступаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньУстановленВручную</Name>
					<Comment>Если истина — регламентное задание не пересчитывает УровеньДоступа у этого контрагента.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЗаказаПоставщиком</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>(Регл) Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства плательщика НДС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаККонтрагенту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЧерномСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗагрузкиНоменклатурыПоставщиков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦеныГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЕСохранятьИсторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьРассылку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРезервирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРезервирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМСПоОсновномуТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовогоКонтрагентаИзПолучателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаТТН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКонтакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСайта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоВизитаНаСайте</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьФлагРезервПоКонтрагентуВЗаказе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьВсеАктивныеЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРНПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьНовуюЗадачуПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючАпи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТТННаплатформе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМ_КлючAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаценкаНаБазовыйТипЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерыПокупателя</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МенеджерПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоваяПочта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
// Карточка контрагента - управляемая форма элемента справочника Контрагенты.
//
// Перенесена с обычной формы (Forms/ФормаЭлемента, Form.bin). Перенесено:
// все реквизиты объекта, пять табличных частей, контактная информация из
// регистра сведений КонтактнаяИнформация, списки подчинённых справочников
// (договоры, банковские счета, контактные лица) с кнопками "Сделать основным",
// логика юр./физ. лица, холдинга, автоматического полного наименования,
// создания основного договора при первой записи и выгрузки контактов на сайт.
//
// Обычная форма из конфигурации не удалена: чтобы вернуться, достаточно
// переключить DefaultObjectForm в Catalogs/Контрагенты.xml обратно.
//
// Перенесены и остальные закладки обычной формы: события, свойства, категории,
// схемы налогообложения, контроль продажи ценовых групп, WEB-доступ. Механизмы
// обычных форм, на которых они держались (расширения таблиц Свойства/Категории,
// РаботаСДиалогами), в управляемой форме не существуют, поэтому всё переписано
// прямой работой с регистрами на сервере:
//   свойства            - РегистрСведений.ЗначенияСвойствОбъектов,
//   категории           - РегистрСведений.КатегорииОбъектов,
//   ценовые группы      - РегистрСведений.КонтрольПродажиЦеновыхГруппПоРегионам,
//   WEB-доступ          - РегистрСведений.УчетныеЗаписиИнтернетПользователей,
//   схемы налогообложения - динамический список по регистру с отбором.
//
// Закладка "WEB-доступ" по умолчанию скрыта - так же, как в обычной форме
// (ЭлементыФормы.Панель.Страницы.WEBДоступ.Видимость = Ложь). Механизм в базе
// не используется; чтобы включить - снять скрытие в НастроитьЭлементы.
//
// Журнал звонков вынесен кнопкой: обработка МИКО_стЖурналЗвонков - готовая
// управляемая форма, принимающая параметр "Контакт", и открыть её с отбором по
// контрагенту честнее, чем форкать в карточку 400 строк её запроса, который
// приедет другим при следующем обновлении МИКО.
//
// Через обычную карточку (команда "Старая форма") остались вещи, которые в
// управляемой форме не выполнимы в принципе, потому что это код клиента обычного
// приложения: печать через УниверсальныеМеханизмы с Новый Действие(), отчёты на
// УниверсальныйОтчет (Отчеты.* недоступны в клиенте управляемой формы),
// электронные письма, файлы, поиск дублей перед записью нового контрагента и
// помощник ввода новых контрагентов.
//
// Из обычной формы намеренно не перенесена процедура УбратьОсновнойДоговор:
// при двух и более договорах она делает ОсновнойДоговорКонтрагента = "", то есть
// присваивает ссылочному реквизиту строку. Рабочего варианта у неё два - либо
// ошибка типа при открытии, либо тихая очистка основного договора при каждом
// открытии карточки, и оба хуже, чем не делать ничего. Если очистка задумана -
// вернуть отдельно, явным ПустаяСсылка().
//
// Все обращения к типовым общим модулям (УправлениеКонтактнойИнформацией,
// ОбщегоНазначения, Биас, УправлениеПользователями) идут только из &НаСервере:
// у этих модулей снят флаг "Клиент (управляемое приложение)".

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда

		ЗаполнитьРеквизитыНовогоКонтрагента();

	КонецЕсли;

	// При копировании контактная информация берётся у образца, как в обычной форме.
	ИсточникКонтактов = Объект.Ссылка;

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда

		ИсточникКонтактов = Параметры.ЗначениеКопирования;

	КонецЕсли;

	// События по умолчанию показываем за последний год: без ограничения запрос
	// поднимает все заказы, отгрузки и оплаты контрагента за всю историю.
	КонПериода = НачалоДня(ТекущаяДатаСеанса());
	НачПериода = ДобавитьМесяц(КонПериода, -12);

	НастроитьОтборыСписков(Объект.Ссылка);
	ПрочитатьКонтактнуюИнформациюОбъекта(ИсточникКонтактов);
	ПрочитатьДанныеЗакладок(Объект.Ссылка);
	ОбновитьСлужебныеРеквизиты(Объект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	НастроитьОтборыСписков(ТекущийОбъект.Ссылка);
	ПрочитатьКонтактнуюИнформациюОбъекта(ТекущийОбъект.Ссылка);
	ПрочитатьДанныеЗакладок(ТекущийОбъект.Ссылка);
	ОбновитьСлужебныеРеквизиты(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьЭлементы();

КонецПроцедуры

// Проверки, которые в обычной форме жили в ПередЗаписью и ПриЗаписи, собраны здесь:
// отказ до записи объекта дешевле, чем откат транзакции после неё.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Признак нужен в ПриЗаписиНаСервере: там объект уже записан и ЭтоНовый() врёт.
	ЭтоНовыйЭлемент = ТекущийОбъект.ЭтоНовый();

	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Наименование) Тогда

		ОбщегоНазначения.СообщитьОбОшибке("Не заполнено наименование.", Отказ, "Элемент не записан.");
		Возврат;

	КонецЕсли;

	Если ВходитВХолдинг Тогда

		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ГоловнойКонтрагент) Тогда

			ОбщегоНазначения.СообщитьОбОшибке("Не выбран головной контрагент.", Отказ, "Элемент не записан.");
			Возврат;

		КонецЕсли;

	Иначе

		// Контрагент сам себе головной - так это хранится в типовой конфигурации.
		ТекущийОбъект.ГоловнойКонтрагент = ТекущийОбъект.Ссылка;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ЗаписатьКонтактнуюИнформациюОбъекта(ТекущийОбъект.Ссылка, Отказ);

	Если Отказ Тогда

		Возврат;

	КонецЕсли;

	Если ЭтоНовыйЭлемент Тогда

		СоздатьОсновнойДоговорПриНеобходимости(ТекущийОбъект, Отказ);

		Если Отказ Тогда

			Возврат;

		КонецЕсли;

	КонецЕсли;

	ЗаписатьСвойстваОбъекта(ТекущийОбъект.Ссылка);
	ЗаписатьКатегорииОбъекта(ТекущийОбъект.Ссылка);
	ЗаписатьWEBДоступ(ТекущийОбъект, Отказ);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Сайт узнаёт о контрагенте только отсюда: телефоны и наименование уезжают
	// в очередь контактов и в выгрузку покупателей, как в ПослеЗаписи обычной формы.
	Контакты = ОбщегоНазначения.КонтактыКонтрагента(ТекущийОбъект.Ссылка);

	Если Контакты <> КонтактыДо
		Или ТекущийОбъект.Наименование <> НаименованиеДо Тогда

		ОбщегоНазначения.ЗаписатьНовыйКонтакт(ТекущийОбъект.Ссылка);

	КонецЕсли;

	Биас.ВыгрузкаПокупателейНашСайт(ТекущийОбъект.Ссылка);

	ЭтоНовыйЭлемент = Ложь;

	НастроитьОтборыСписков(ТекущийОбъект.Ссылка);
	ПрочитатьКонтактнуюИнформациюОбъекта(ТекущийОбъект.Ссылка);
	ПрочитатьДанныеЗакладок(ТекущийОбъект.Ссылка);
	ОбновитьСлужебныеРеквизиты(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	НастроитьЭлементы();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Если ФормироватьНаименованиеПолноеАвтоматически Тогда

		Объект.НаименованиеПолное = Объект.Наименование;

	КонецЕсли;

КонецПроцедуры

// Полное наименование ведут вручную ровно с того момента, как оно разошлось
// с кратким: до этого его переписывает НаименованиеПриИзменении.
//
&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)

	ФормироватьНаименованиеПолноеАвтоматически =
		(ПустаяСтрока(Объект.НаименованиеПолное) Или Объект.НаименованиеПолное = Объект.Наименование);

КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)

	НастроитьЭлементы();

КонецПроцедуры

&НаКлиенте
Процедура ПокупательПоставщикПриИзменении(Элемент)

	НастроитьЭлементы();

КонецПроцедуры

&НаКлиенте
Процедура РассылкаТГПриИзменении(Элемент)

	НастроитьЭлементы();

КонецПроцедуры

&НаКлиенте
Процедура ВходитВХолдингПриИзменении(Элемент)

	Если ВходитВХолдинг И Объект.ГоловнойКонтрагент = Объект.Ссылка Тогда

		Объект.ГоловнойКонтрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");

	КонецЕсли;

	Если НЕ ВходитВХолдинг
		Или НЕ ЗначениеЗаполнено(Объект.ГоловнойКонтрагент)
		Или Объект.ГоловнойКонтрагент = Объект.Ссылка Тогда

		Объект.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Ложь;

	КонецЕсли;

	НастроитьЭлементы();

КонецПроцедуры

&НаКлиенте
Процедура ГоловнойКонтрагентПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(Объект.ГоловнойКонтрагент)
		Или Объект.ГоловнойКонтрагент = Объект.Ссылка Тогда

		Объект.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Ложь;

	КонецЕсли;

	НастроитьЭлементы();

КонецПроцедуры

&НаКлиенте
Процедура ГоловнойКонтрагентОчистка(Элемент, СтандартнаяОбработка)

	Объект.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Ложь;
	НастроитьЭлементы();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦ

// Телефон хранится разложенным по полям (код страны, код города, номер), и
// печатные формы читают именно их. Набранный руками номер надо разложить заново,
// иначе в документы уедет старый. Для адресов обычная форма этого не делала -
// там поля заполняет отдельный диалог редактирования адреса.
//
&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеПриИзменении(Элемент)

	ТекущиеДанные = Элементы.КонтактнаяИнформация.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		Или ТекущиеДанные.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда

		Возврат;

	КонецЕсли;

	РазложитьТелефонНаСервере(ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура ТорговыеТочкиПриАктивизацииСтроки(Элемент)

	Элементы.НадписьКоличествоТТ.Заголовок = Строка(Объект.ТорговыеТочки.Количество()) + " ТТ";

КонецПроцедуры

&НаКлиенте
Процедура МенеджерыПокупателяМенеджерПриИзменении(Элемент)

	ТекущиеДанные = Элементы.МенеджерыПокупателя.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		Или НЕ ЗначениеЗаполнено(ТекущиеДанные.МенеджерПокупателя) Тогда

		Возврат;

	КонецЕсли;

	Отбор = Новый Структура("МенеджерПокупателя", ТекущиеДанные.МенеджерПокупателя);

	Если Объект.МенеджерыПокупателя.НайтиСтроки(Отбор).Количество() > 1 Тогда

		Предупреждение("Выбранный менеджер покупателя уже есть в списке.");
		ТекущиеДанные.МенеджерПокупателя = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МенеджерыПокупателяПередУдалением(Элемент, Отказ)

	ТекущиеДанные = Элементы.МенеджерыПокупателя.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		Или ТекущиеДанные.МенеджерПокупателя <> Объект.ОсновнойМенеджерПокупателя Тогда

		Возврат;

	КонецЕсли;

	Отказ = (Вопрос("Данный менеджер является основным. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да);

	Если НЕ Отказ Тогда

		Объект.ОсновнойМенеджерПокупателя = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыДеятельностиВидПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ВидыДеятельности.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		Или НЕ ЗначениеЗаполнено(ТекущиеДанные.ВидДеятельности) Тогда

		Возврат;

	КонецЕсли;

	Отбор = Новый Структура("ВидДеятельности", ТекущиеДанные.ВидДеятельности);

	Если Объект.ВидыДеятельности.НайтиСтроки(Отбор).Количество() > 1 Тогда

		Предупреждение("Выбранный вид деятельности уже есть в списке.");
		ТекущиеДанные.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельностиКонтрагентов.ПустаяСсылка");
		Возврат;

	КонецЕсли;

	Если Объект.ВидыДеятельности.Количество() = 1
		И НЕ ЗначениеЗаполнено(Объект.ОсновнойВидДеятельности) Тогда

		Если Вопрос("Установить текущий вид деятельности основным?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда

			Объект.ОсновнойВидДеятельности = ТекущиеДанные.ВидДеятельности;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыДеятельностиПередУдалением(Элемент, Отказ)

	ТекущиеДанные = Элементы.ВидыДеятельности.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено
		Или ТекущиеДанные.ВидДеятельности <> Объект.ОсновнойВидДеятельности Тогда

		Возврат;

	КонецЕсли;

	Отказ = (Вопрос("Данный вид деятельности является основным. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да);

	Если НЕ Отказ Тогда

		Объект.ОсновнойВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельностиКонтрагентов.ПустаяСсылка");

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

// Код автонумеруемый, поэтому поле открыто на запись только по явной команде -
// как кнопка "Включить возможность редактирования кода" в обычной форме.
//
&НаКлиенте
Процедура КомандаРедактироватьКод(Команда)

	Элементы.Код.ТолькоПросмотр = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСделатьОсновнымДоговор(Команда)

	Договор = Элементы.Договоры.ТекущаяСтрока;

	Если НЕ ЗначениеЗаполнено(Договор) Тогда

		Возврат;

	КонецЕсли;

	Если ЭтоГруппаДоговоров(Договор) Тогда

		Предупреждение("Основным договором можно назначить только договор, а не группу.");
		Возврат;

	КонецЕсли;

	Объект.ОсновнойДоговорКонтрагента = Договор;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСделатьОсновнымБанковскийСчет(Команда)

	Счет = Элементы.БанковскиеСчета.ТекущаяСтрока;

	Если ЗначениеЗаполнено(Счет) Тогда

		Объект.ОсновнойБанковскийСчет = Счет;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСделатьОсновнымКонтактноеЛицо(Команда)

	КонтактноеЛицо = Элементы.КонтактныеЛица.ТекущаяСтрока;

	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда

		Объект.ОсновноеКонтактноеЛицо = КонтактноеЛицо;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСделатьОсновнымМенеджера(Команда)

	ТекущиеДанные = Элементы.МенеджерыПокупателя.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.МенеджерПокупателя) Тогда

		Объект.ОсновнойМенеджерПокупателя = ТекущиеДанные.МенеджерПокупателя;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСделатьОсновнымВидДеятельности(Команда)

	ТекущиеДанные = Элементы.ВидыДеятельности.ТекущиеДанные;

	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ВидДеятельности) Тогда

		Объект.ОсновнойВидДеятельности = ТекущиеДанные.ВидДеятельности;

	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НастроитьЭлементы()

	ЭтоФизЛицо = (Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"));

	Элементы.ГруппаЮрЛицо.Видимость  = НЕ ЭтоФизЛицо;
	Элементы.ГруппаФизЛицо.Видимость = ЭтоФизЛицо;

	Элементы.ГоловнойКонтрагент.Видимость = ВходитВХолдинг;

	Элементы.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН.Доступность =
		ВходитВХолдинг
		И ЗначениеЗаполнено(Объект.ГоловнойКонтрагент)
		И Объект.ГоловнойКонтрагент <> Объект.Ссылка;

	Элементы.ГруппаПоставщик.Видимость = Объект.Поставщик;

	Элементы.НадписьРассылкаТГ.Видимость   = ЗначениеЗаполнено(Объект.РассылкаТГ);
	Элементы.НадписьРассылкаТГ.Заголовок   = "Рассылка ТГ: " + СокрЛП(Объект.РассылкаТГ);
	Элементы.НадписьКоличествоТТ.Заголовок = Строка(Объект.ТорговыеТочки.Количество()) + " ТТ";

	// Договоры, счета и контактные лица подчинены контрагенту: пока он не записан,
	// владельца у них нет и заводить их некуда.
	Записан = НЕ Объект.Ссылка.Пустая();

	Элементы.СтраницаСчетаИДоговоры.Доступность    = Записан;
	Элементы.ГруппаКонтактныеЛица.Доступность      = Записан;
	Элементы.СтраницаСобытия.Доступность           = Записан;
	Элементы.СтраницаЗвонки.Доступность            = Записан;
	Элементы.СтраницаСвойства.Доступность          = Записан;
	Элементы.СтраницаНалогообложение.Доступность   = Записан;
	Элементы.ЦеновыеГруппы.Доступность             = Записан;

	// В обычной форме страница WEB-доступа скрыта - механизм учётных записей
	// интернет-пользователей в этой базе не используется. Скрываем так же.
	Элементы.СтраницаWEBДоступ.Видимость = Ложь;

	Элементы.Логин.Доступность                     = РазрешенДоступКWEBЗаказам;
	Элементы.Пароль.Доступность                    = РазрешенДоступКWEBЗаказам;
	Элементы.КоманднаяПанельПароль.Доступность     = РазрешенДоступКWEBЗаказам;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСлужебныеРеквизиты(Знач ТекущийОбъект)

	// Головным сам себе контрагент числится, когда он не филиал: обычная форма
	// разворачивает это в флажок "Входит в холдинг" и обратно при записи.
	ВходитВХолдинг = НЕ (ТекущийОбъект.Ссылка.Пустая() Или ТекущийОбъект.ГоловнойКонтрагент = ТекущийОбъект.Ссылка);

	ФормироватьНаименованиеПолноеАвтоматически =
		(ПустаяСтрока(ТекущийОбъект.НаименованиеПолное) Или ТекущийОбъект.НаименованиеПолное = ТекущийОбъект.Наименование);

	СтадияВзаимоотношений = ПрочитатьСтадиюВзаимоотношений(ТекущийОбъект.Ссылка);
	ABCКлассПокупателя    = ПрочитатьABCКлассПокупателя(ТекущийОбъект.Ссылка);
	НадежностьПоставщика  = ПрочитатьНадежность(ТекущийОбъект.Ссылка);

	Элементы.НадписьДолг.Заголовок = ПредставлениеДолга(ТекущийОбъект.Ссылка);

	КонтактыДо     = ОбщегоНазначения.КонтактыКонтрагента(ТекущийОбъект.Ссылка);
	НаименованиеДо = ТекущийОбъект.Наименование;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыНовогоКонтрагента()

	Если НЕ ЗначениеЗаполнено(Объект.ЮрФизЛицо) Тогда

		Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;

	КонецЕсли;

	// У копии статусы и группа доступа приезжают от образца - перетирать их нечем.
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда

		Возврат;

	КонецЕсли;

	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");

	ОсновнойСтатус = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойСтатусКонтрагента");

	Объект.Покупатель = (ОсновнойСтатус = Перечисления.СтатусыКонтрагентов.Покупатель);
	Объект.Поставщик  = (ОсновнойСтатус = Перечисления.СтатусыКонтрагентов.Поставщик);

	Объект.ГруппаДоступаККонтрагенту =
		УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяГруппаДоступаККонтрагенту");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОНТАКТНАЯ ИНФОРМАЦИЯ

// Читает КИ в таблицу формы. Типовая ПрочитатьКонтактнуюИнформацию возвращает
// не только заполненные записи регистра, но и пустые строки по всем видам КИ
// контрагента - поэтому таблица на форме не пополняется вручную, виды в ней
// уже перечислены, заполняется только представление.
//
&НаСервере
Процедура ПрочитатьКонтактнуюИнформациюОбъекта(Знач Владелец)

	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	УправлениеКонтактнойИнформацией.ПрочитатьКонтактнуюИнформацию(Набор, Владелец);

	ЗаполнитьТаблицуКонтактнойИнформации(Набор);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонтактнуюИнформациюОбъекта(Знач Владелец, Отказ)

	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();

	Набор.Отбор.Объект.Значение      = Владелец;
	Набор.Отбор.Объект.Использование = Истина;

	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда

			Продолжить;

		КонецЕсли;

		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаКИ);
		Запись.Объект = Владелец;

	КонецЦикла;

	УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Набор, Владелец, Отказ);

	Если Отказ Тогда

		Возврат;

	КонецЕсли;

	// ЗаписатьКонтактнуюИнформацию перечитывает набор после записи - забираем его
	// обратно на форму, чтобы таблица показывала то же, что лежит в регистре.
	ЗаполнитьТаблицуКонтактнойИнформации(Набор);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКонтактнойИнформации(Знач Набор)

	КонтактнаяИнформация.Очистить();

	Для Каждого Запись Из Набор Цикл

		НоваяСтрока = КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура РазложитьТелефонНаСервере(Знач Идентификатор)

	СтрокаКИ = КонтактнаяИнформация.НайтиПоИдентификатору(Идентификатор);

	Если СтрокаКИ = Неопределено Тогда

		Возврат;

	КонецЕсли;

	Поля = УправлениеКонтактнойИнформацией.РазложитьТелефонПоПолям(СтрокаКИ.Представление);

	СтрокаКИ.Поле1 = Поля.КодСтраны;
	СтрокаКИ.Поле2 = Поля.КодГорода;
	СтрокаКИ.Поле3 = Поля.СамТелефон;

	УправлениеКонтактнойИнформацией.СформироватьПредставлениеТелефона(СтрокаКИ);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СПИСКИ ПОДЧИНЁННЫХ СПРАВОЧНИКОВ

&НаСервере
Процедура НастроитьОтборыСписков(Знач Владелец)

	УстановитьОтборСписка(Договоры, "Владелец", Владелец);
	УстановитьОтборСписка(БанковскиеСчета, "Владелец", Владелец);
	УстановитьОтборСписка(КонтактныеЛица, "Владелец", Владелец);
	УстановитьОтборСписка(СхемыНалогообложения, "Контрагент", Владелец);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка(Список, Знач ИмяПоля, Знач Значение)

	Список.Отбор.Элементы.Очистить();

	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Значение;
	ЭлементОтбора.Использование  = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппаДоговоров(Знач Договор)

	Возврат Договор.ЭтоГруппа;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОСНОВНОЙ ДОГОВОР

// Перенос ПроверитьОсновнойДоговорКонтрагента с обычной формы: у нового контрагента
// должен быть договор, иначе по нему нельзя провести ни один документ. Договор
// создаётся уже после записи контрагента (раньше не на кого его повесить), поэтому
// карточку приходится дописывать вторым проходом.
//
&НаСервере
Процедура СоздатьОсновнойДоговорПриНеобходимости(ТекущийОбъект, Отказ)

	Если ЗначениеЗаполнено(ТекущийОбъект.ОсновнойДоговорКонтрагента) Тогда

		Возврат;

	КонецЕсли;

	ВыборкаДоговоров = Справочники.ДоговорыКонтрагентов.Выбрать( , ТекущийОбъект.Ссылка);

	Если ВыборкаДоговоров.Следующий() Тогда

		ТекущийОбъект.ОсновнойДоговорКонтрагента = ВыборкаДоговоров.Ссылка;
		ТекущийОбъект.Записать();
		Возврат;

	КонецЕсли;

	ТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");

	Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();

	Договор.Наименование = "Основной договор";
	Договор.Владелец     = ТекущийОбъект.Ссылка;

	Договор.ВалютаВзаиморасчетов =
		УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяВалютаВзаиморасчетов");

	Если НЕ ЗначениеЗаполнено(Договор.ВалютаВзаиморасчетов) Тогда

		Договор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета");

	КонецЕсли;

	Договор.УстановитьСхемуНалогообложения();

	Если ТекущийОбъект.НеЯвляетсяРезидентом Тогда

		Договор.Внешнеэкономический = Истина;

		Если Договор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаРегламентированногоУчета") Тогда

			Договор.ВалютаВзаиморасчетов = глЗначениеПеременной("ВалютаУправленческогоУчета");

		КонецЕсли;

	КонецЕсли;

	Договор.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнаяОрганизация");

	Если НЕ ЗначениеЗаполнено(Договор.Организация) Тогда

		Договор.Организация = ПерваяОрганизация();

		Если НЕ ЗначениеЗаполнено(Договор.Организация) Тогда

			ОбщегоНазначения.СообщитьОбОшибке(
				"Не удалось записать основной договор контрагента (не найдена организация).", Отказ);
			Возврат;

		КонецЕсли;

	КонецЕсли;

	Договор.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;

	Если ТекущийОбъект.Покупатель Тогда

		Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		Договор.ТипЦен      = Справочники.ТипыЦенНоменклатуры.ПустаяСсылка();

	ИначеЕсли ТекущийОбъект.Поставщик Тогда

		Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		Договор.ТипЦен      = Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка();

	Иначе

		Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;

	КонецЕсли;

	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда

		Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;

	Иначе

		Договор.ВедениеВзаиморасчетов =
			УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновноеВедениеВзаиморасчетовПоДоговорам");

		Если НЕ ЗначениеЗаполнено(Договор.ВедениеВзаиморасчетов) Тогда

			Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;

			Договор.ВестиПоДокументамРасчетовСКонтрагентом =
				УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновныеРасчетыПоДокументамСКонтрагентами");

		КонецЕсли;

	КонецЕсли;

	Если Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
		Или Договор.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда

		Договор.ОбособленныйУчетТоваровПоЗаказамПокупателей =
			УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");

	КонецЕсли;

	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда

		Договор.ПроцентПредоплаты =
			УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");

	КонецЕсли;

	Договор.СложныйНалоговыйУчет =
		УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОсновноеЗначениеСложныйНалоговыйУчет");

	Если Договор.Внешнеэкономический Тогда

		Договор.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ВЭД;

	Иначе

		Договор.СхемаНалоговогоУчета = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;

	КонецЕсли;

	Договор.СхемаНалоговогоУчетаПоТаре = Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.ПоПервомуСобытию;

	Договор.ВыводитьИнформациюОСделкеПриПечатиДокументов = Истина;

	Попытка

		Договор.Записать();

	Исключение

		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(), Отказ, "Не удалось записать основной договор контрагента.");
		Возврат;

	КонецПопытки;

	ТекущийОбъект.ОсновнойДоговорКонтрагента = Договор.Ссылка;
	ТекущийОбъект.Записать();

КонецПроцедуры

&НаСервере
Функция ПерваяОрганизация()

	Запрос = Новый Запрос;

	Запрос.Текст =

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		Возврат Выборка.Ссылка;

	КонецЕсли;

	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОКАЗАТЕЛИ ПО КОНТРАГЕНТУ

&НаСервере
Функция ПрочитатьСтадиюВзаимоотношений(Знач Ссылка)

	НеУказана = "Стадия взаимоотношений не указана";

	Если Ссылка.Пустая() Тогда

		Возврат НеУказана;

	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СрезПоследних.Стадия КАК Стадия,
		|	СрезПоследних.КлассПостоянногоПокупателя КАК КлассПостоянногоПокупателя
		|ИЗ
		|	РегистрСведений.СтадииВзаимоотношенийСПокупателями.СрезПоследних(, Контрагент = &Ссылка) КАК СрезПоследних";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Если НЕ Выборка.Следующий() Или НЕ ЗначениеЗаполнено(Выборка.Стадия) Тогда

		Возврат НеУказана;

	КонецЕсли;

	Если Выборка.Стадия = Перечисления.СтадииВзаимоотношенийСПокупателями.ПостоянныйПокупатель Тогда

		Класс = ?(Выборка.КлассПостоянногоПокупателя.Пустая(), "класс не выбран", СокрЛП(Выборка.КлассПостоянногоПокупателя));

		Возврат СокрЛП(Выборка.Стадия) + " (" + Класс + ")";

	КонецЕсли;

	Возврат СокрЛП(Выборка.Стадия);

КонецФункции

&НаСервере
Функция ПрочитатьABCКлассПокупателя(Знач Ссылка)

	НеУказан = "АВС-класс не указан";

	Если Ссылка.Пустая() Тогда

		Возврат НеУказан;

	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СрезПоследних.ABCКлассПокупателя КАК ABCКлассПокупателя
		|ИЗ
		|	РегистрСведений.ABCКлассификацияПокупателей.СрезПоследних(, Контрагент = &Ссылка) КАК СрезПоследних";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ABCКлассПокупателя) Тогда

		Возврат СокрЛП(Выборка.ABCКлассПокупателя);

	КонецЕсли;

	Возврат НеУказан;

КонецФункции

&НаСервере
Функция ПрочитатьНадежность(Знач Ссылка)

	НеУказана = "Надежность не указана";

	Если Ссылка.Пустая() Тогда

		Возврат НеУказана;

	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СрезПоследних.Надежность КАК Надежность
		|ИЗ
		|	РегистрСведений.НадежностьПоставщиков.СрезПоследних(, Контрагент = &Ссылка) КАК СрезПоследних";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Надежность) Тогда

		Возврат СокрЛП(Выборка.Надежность);

	КонецЕсли;

	Возврат НеУказана;

КонецФункции

&НаСервере
Функция ПредставлениеДолга(Знач Ссылка)

	Если Ссылка.Пустая() Тогда

		Возврат "";

	КонецЕсли;

	Долг = Документы.ЗаказПокупателя.ДолгКонтрагентаНаДату(Ссылка, ТекущаяДатаСеанса());

	Возврат ?(Долг >= 0, "Долг: ", "Переплата: ") + СокрЛП(Долг);

КонецФункции
